In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"Name":["Josh","Mike","Ana","Yohanna"],"Employee_Number": [11286474,17588462,26735655,18653472],
                   "Income": [5000,7000,9000,6000],"Age":[35,19,26,32]})
df

      Name  Employee_Number  Income  Age
0     Josh         11286474    5000   35
1     Mike         17588462    7000   19
2      Ana         26735655    9000   26
3  Yohanna         18653472    6000   32

In [3]:
df = df.set_index("Employee_Number")
df

                    Name  Income  Age
Employee_Number
11286474            Josh    5000   35
17588462            Mike    7000   19
26735655             Ana    9000   26
18653472         Yohanna    6000   32

In [4]:
df.loc[11286474]

Name      Josh
Income    5000
Age         35
Name: 11286474, dtype: object

In [6]:
##df.set_index("Employee_Number",inplace=True)

In [7]:
df

                    Name  Income  Age
Employee_Number
11286474            Josh    5000   35
17588462            Mike    7000   19
26735655             Ana    9000   26
18653472         Yohanna    6000   32

In [8]:
df.reset_index(inplace=True)
df

   Employee_Number     Name  Income  Age
0         11286474     Josh    5000   35
1         17588462     Mike    7000   19
2         26735655      Ana    9000   26
3         18653472  Yohanna    6000   32

In [9]:
df.sort_index(inplace=True)
df

   Employee_Number     Name  Income  Age
0         11286474     Josh    5000   35
1         17588462     Mike    7000   19
2         26735655      Ana    9000   26
3         18653472  Yohanna    6000   32

In [10]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"],
                          "Department":["IT","Human Resources","Finance","Supply Chain"],
                          "Income":[4800,5200,6600,5700],
                          "Age":[24,28,33,41]})
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [11]:
employees["Department"] == "IT"

0     True
1    False
2    False
3    False
Name: Department, dtype: bool

In [ ]:
employees.loc[employees["Deparrtment"]]

In [13]:
employees.iloc[0:2,0:2]

   Name       Department
0  Josh               IT
1  Mike  Human Resources

In [16]:
employees.Income >5500

0    False
1    False
2     True
3     True
Name: Income, dtype: bool

In [17]:
employees['Income'] > 5500

0    False
1    False
2     True
3     True
Name: Income, dtype: bool

In [18]:
employees[employees['Income'] > 5500]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

In [19]:
employees[employees["Age"]>30]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

AND

In [20]:
employees[(employees["Age"]>30) & (employees["Income"]>30)]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

In [21]:
employees[(employees["Age"]>30) & (employees["Income"]>5000)]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

In [22]:
employees[(employees["Name"]=="Sergio") & (employees["Department"]== "IT")]

Empty DataFrame
Columns: [Name, Department, Income, Age]
Index: []

In [23]:
(employees["Name"]=="Sergio") & (employees["Department"]== "IT")

0    False
1    False
2    False
3    False
dtype: bool

In [24]:
employees[(employees["Name"]=="Sergio") & (employees["Department"]== "Supply Chain")]

     Name    Department  Income  Age
3  Sergio  Supply Chain    5700   41

OR

In [25]:
employees[(employees["Age"]>30) | (employees["Income"]>5000)]

     Name       Department  Income  Age
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [27]:
employees[(employees["Name"]=="Sergio") | (employees["Department"]== "IT")]

     Name    Department  Income  Age
0    Josh            IT    4800   24
3  Sergio  Supply Chain    5700   41

Tilde for Opposite

In [28]:
employees[~(employees["Income"]>5300)]

   Name       Department  Income  Age
0  Josh               IT    4800   24
1  Mike  Human Resources    5200   28

In [29]:
employees[~(employees["Age"]<35)]

     Name    Department  Income  Age
3  Sergio  Supply Chain    5700   41

In [30]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41